---
type: RebarShapeConstraintDiameter
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarShapeConstraintDiameter

`Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintDiameter | 2012 | `public RebarShapeConstraintDiameter ( ElementId paramId , RebarShapeArcReferenceType refType )` |
| Property | ArcReferenceType | 2012 | `public RebarShapeArcReferenceType ArcReferenceType { get ; }` |